def lab6n1():
    sl = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(sl)
    strana = input("Введите страну: ")
    print(sl[strana])


def lab6n2():
    s = 0
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }
    a = input("Введите слово: ")
    for key in alph:
        if key in a:
            s += alph[key]
    print("Сумма очков:", s)




def lab6n3():
    import random

    sp1 = ['Чел1', 'Чел2', 'Чел3', 'Чел4', 'Чел5']
    alph = {'Китайский': "", 'Русский': "", 'Английский': "", 'Японский': "", 'Немецкий': ""}
    sp3 = []

    for i in alph:
        q = random.randint(1, 3)
        alph[i] = random.choice(str(q))
        for j in range(q):
            sp3.append(random.choice(sp1))
    print(sp3)
    for i in range(len(sp3) - 1):
        while sp3[i] == sp3[i + 1]:  # может быть так, что китайский знает несколько раз один и тот же чел
            sp3[i + 1] = random.choice(sp1)  # поэтому делаем while, чтобы не зарандомился тот же чел
    print(sp3)

    print(alph)
    print(sp3[:int(alph['Китайский'])])



lab6n1()
lab6n2()
lab6n3()